11_美好时光海苔_个性社交音乐网站/app/views/songs/show.html.slim

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
- user = @song.user
- cache @song do
  .ui.grid
    .four.wide.column
    .eight.wide.column
      .ui.one.column.grid.songs-list id="song-#{@song.id}"
        .sixteen.wide.column.song-info

SELECT "comments".* FROM "comments" WHERE "comments"."song_id" IN (1)
---

      #comments
        .column
          .ui.comments