11_美好时光海苔_个性社交音乐网站/app/controllers/users_controller.rb

  def show
    if @user
      @songs = @user.songs.order("created_at desc")
---
SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = ?  ORDER BY created_at desc  [["user_id", 1]]

  def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("name", "email", "salt", "crypted_password", "created_at", "updated_at", "activation_token", "activation_state") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(update_user_params)
---
UPDATE "users" SET "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar", "58f1336a5_l.jpg"], ["updated_at", "2016-01-20 09:42:04.724064"], ["id", 1]]

  def user_songs
    @songs = @user.songs.order("created_at desc")
---
SELECT "songs".* FROM "songs" WHERE "songs"."user_id" = ?  ORDER BY created_at desc  [["user_id", 1]]

  def favorite_songs
    songs_id = @user.likeships.where("likeable_type = ?", "Song").collect(&:likeable_id)
    @songs = Song.find(songs_id).reverse!
---
SELECT "likeships".* FROM "likeships" WHERE "likeships"."user_id" = ? AND (likeable_type = 'Song')  [["user_id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]

  def find_correct_user
    @user = User.find_by_name(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT 1  [["name", "yuan"]]